#### Terraform Plan Output
   ```
   
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # apstra_blueprint_deployment.dc_1 will be created
  + resource "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = (known after apply)
      + comment                 = "Deployment by Terraform {{.TerraformVersion}}, Apstra provider {{.ProviderVersion}}, User $USER."
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # null_resource.force_redeploy will be created
  + resource "null_resource" "force_redeploy" {
      + id       = (known after apply)
      + triggers = {
          + "fabric_staging_revision"      = (known after apply)
          + "vpn_routing_staging_revision" = (known after apply)
        }
    }

  # module.fabric.data.apstra_blueprint_deployment.dc_1 will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = (known after apply)
      + comment                 = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # module.fabric.data.apstra_datacenter_routing_zone.default will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_routing_zone" "default" {
      + blueprint_id             = (known after apply)
      + dhcp_servers             = (known after apply)
      + had_prior_vlan_id_config = (known after apply)
      + had_prior_vni_config     = (known after apply)
      + id                       = (known after apply)
      + name                     = "default"
      + routing_policy_id        = (known after apply)
      + vlan_id                  = (known after apply)
      + vni                      = (known after apply)
    }

  # module.fabric.apstra_asn_pool.leaf will be created
  + resource "apstra_asn_pool" "leaf" {
      + id              = (known after apply)
      + name            = "terraform leaf"
      + ranges          = [
          + {
              + first           = 200
              + last            = 299
              + status          = (known after apply)
              + total           = (known after apply)
              + used            = (known after apply)
              + used_percentage = (known after apply)
            },
        ]
      + status          = (known after apply)
      + total           = (known after apply)
      + used            = (known after apply)
      + used_percentage = (known after apply)
    }

  # module.fabric.apstra_asn_pool.spine will be created
  + resource "apstra_asn_pool" "spine" {
      + id              = (known after apply)
      + name            = "terraform spine"
      + ranges          = [
          + {
              + first           = 100
              + last            = 199
              + status          = (known after apply)
              + total           = (known after apply)
              + used            = (known after apply)
              + used_percentage = (known after apply)
            },
        ]
      + status          = (known after apply)
      + total           = (known after apply)
      + used            = (known after apply)
      + used_percentage = (known after apply)
    }

  # module.fabric.apstra_datacenter_blueprint.dc_1 will be created
  + resource "apstra_datacenter_blueprint" "dc_1" {
      + access_switch_count     = (known after apply)
      + build_errors_count      = (known after apply)
      + build_warnings_count    = (known after apply)
      + esi_mac_msb             = (known after apply)
      + external_router_count   = (known after apply)
      + generic_system_count    = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + id                      = (known after apply)
      + ipv6_applications       = (known after apply)
      + leaf_switch_count       = (known after apply)
      + name                    = "DC 1"
      + spine_count             = (known after apply)
      + status                  = (known after apply)
      + superspine_count        = (known after apply)
      + template_id             = "L2_Virtual_EVPN"
      + version                 = (known after apply)
    }

  # module.fabric.apstra_datacenter_device_allocation.all["l2_virtual_001_leaf1"] will be created
  + resource "apstra_datacenter_device_allocation" "all" {
      + blueprint_id             = (known after apply)
      + deploy_mode              = (known after apply)
      + device_profile_node_id   = (known after apply)
      + initial_interface_map_id = "Juniper_vQFX__AOS-7x10-Leaf"
      + interface_map_name       = (known after apply)
      + node_id                  = (known after apply)
      + node_name                = "l2_virtual_001_leaf1"
    }

  # module.fabric.apstra_datacenter_device_allocation.all["l2_virtual_002_leaf1"] will be created
  + resource "apstra_datacenter_device_allocation" "all" {
      + blueprint_id             = (known after apply)
      + deploy_mode              = (known after apply)
      + device_profile_node_id   = (known after apply)
      + initial_interface_map_id = "Juniper_vQFX__AOS-7x10-Leaf"
      + interface_map_name       = (known after apply)
      + node_id                  = (known after apply)
      + node_name                = "l2_virtual_002_leaf1"
    }

  # module.fabric.apstra_datacenter_device_allocation.all["l2_virtual_003_leaf1"] will be created
  + resource "apstra_datacenter_device_allocation" "all" {
      + blueprint_id             = (known after apply)
      + deploy_mode              = (known after apply)
      + device_profile_node_id   = (known after apply)
      + initial_interface_map_id = "Juniper_vQFX__AOS-7x10-Leaf"
      + interface_map_name       = (known after apply)
      + node_id                  = (known after apply)
      + node_name                = "l2_virtual_003_leaf1"
    }

  # module.fabric.apstra_datacenter_device_allocation.all["l2_virtual_004_leaf1"] will be created
  + resource "apstra_datacenter_device_allocation" "all" {
      + blueprint_id             = (known after apply)
      + deploy_mode              = (known after apply)
      + device_profile_node_id   = (known after apply)
      + initial_interface_map_id = "Juniper_vQFX__AOS-7x10-Leaf"
      + interface_map_name       = (known after apply)
      + node_id                  = (known after apply)
      + node_name                = "l2_virtual_004_leaf1"
    }

  # module.fabric.apstra_datacenter_device_allocation.all["spine1"] will be created
  + resource "apstra_datacenter_device_allocation" "all" {
      + blueprint_id             = (known after apply)
      + deploy_mode              = (known after apply)
      + device_profile_node_id   = (known after apply)
      + initial_interface_map_id = "Juniper_vQFX__AOS-7x10-Spine"
      + interface_map_name       = (known after apply)
      + node_id                  = (known after apply)
      + node_name                = "spine1"
    }

  # module.fabric.apstra_datacenter_device_allocation.all["spine2"] will be created
  + resource "apstra_datacenter_device_allocation" "all" {
      + blueprint_id             = (known after apply)
      + deploy_mode              = (known after apply)
      + device_profile_node_id   = (known after apply)
      + initial_interface_map_id = "Juniper_vQFX__AOS-7x10-Spine"
      + interface_map_name       = (known after apply)
      + node_id                  = (known after apply)
      + node_name                = "spine2"
    }

  # module.fabric.apstra_datacenter_resource_pool_allocation.leaf_asn will be created
  + resource "apstra_datacenter_resource_pool_allocation" "leaf_asn" {
      + blueprint_id = (known after apply)
      + pool_ids     = [
          + (known after apply),
        ]
      + role         = "leaf_asns"
    }

  # module.fabric.apstra_datacenter_resource_pool_allocation.leaf_lo will be created
  + resource "apstra_datacenter_resource_pool_allocation" "leaf_lo" {
      + blueprint_id = (known after apply)
      + pool_ids     = [
          + (known after apply),
        ]
      + role         = "leaf_loopback_ips"
    }

  # module.fabric.apstra_datacenter_resource_pool_allocation.spine_asn will be created
  + resource "apstra_datacenter_resource_pool_allocation" "spine_asn" {
      + blueprint_id = (known after apply)
      + pool_ids     = [
          + (known after apply),
        ]
      + role         = "spine_asns"
    }

  # module.fabric.apstra_datacenter_resource_pool_allocation.spine_leaf will be created
  + resource "apstra_datacenter_resource_pool_allocation" "spine_leaf" {
      + blueprint_id = (known after apply)
      + pool_ids     = [
          + (known after apply),
        ]
      + role         = "spine_leaf_link_ips"
    }

  # module.fabric.apstra_datacenter_resource_pool_allocation.spine_lo will be created
  + resource "apstra_datacenter_resource_pool_allocation" "spine_lo" {
      + blueprint_id = (known after apply)
      + pool_ids     = [
          + (known after apply),
        ]
      + role         = "spine_loopback_ips"
    }

  # module.fabric.apstra_ipv4_pool.leaf will be created
  + resource "apstra_ipv4_pool" "leaf" {
      + id              = (known after apply)
      + name            = "terraform leaf loopbacks"
      + status          = (known after apply)
      + subnets         = [
          + {
              + network         = "10.0.1.0/24"
              + status          = (known after apply)
              + total           = (known after apply)
              + used            = (known after apply)
              + used_percentage = (known after apply)
            },
        ]
      + total           = (known after apply)
      + used            = (known after apply)
      + used_percentage = (known after apply)
    }

  # module.fabric.apstra_ipv4_pool.spine will be created
  + resource "apstra_ipv4_pool" "spine" {
      + id              = (known after apply)
      + name            = "terraform spine loopbacks"
      + status          = (known after apply)
      + subnets         = [
          + {
              + network         = "10.0.0.0/24"
              + status          = (known after apply)
              + total           = (known after apply)
              + used            = (known after apply)
              + used_percentage = (known after apply)
            },
        ]
      + total           = (known after apply)
      + used            = (known after apply)
      + used_percentage = (known after apply)
    }

  # module.fabric.apstra_ipv4_pool.spine_leaf will be created
  + resource "apstra_ipv4_pool" "spine_leaf" {
      + id              = (known after apply)
      + name            = "terraform spine leaf"
      + status          = (known after apply)
      + subnets         = [
          + {
              + network         = "10.0.2.0/24"
              + status          = (known after apply)
              + total           = (known after apply)
              + used            = (known after apply)
              + used_percentage = (known after apply)
            },
        ]
      + total           = (known after apply)
      + used            = (known after apply)
      + used_percentage = (known after apply)
    }

  # module.vpn_routing.data.apstra_blueprint_deployment.dc_1 will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_blueprint_deployment" "dc_1" {
      + blueprint_id            = (known after apply)
      + comment                 = (known after apply)
      + has_uncommitted_changes = (known after apply)
      + revision_active         = (known after apply)
      + revision_staged         = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_bgp_peering_ip_endpoint.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_bgp_peering_ip_endpoint" "vpn" {
      + child_primitives = [
          + (known after apply),
          + (known after apply),
          + (known after apply),
        ]
      + ipv4_address     = "192.168.5.5"
      + primitive        = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_ip_link.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_ip_link" "vpn" {
      + child_primitives     = [
          + (known after apply),
        ]
      + ipv4_addressing_type = "numbered"
      + primitive            = (known after apply)
      + routing_zone_id      = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_A"] will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_B"] will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = (known after apply)
    }

  # module.vpn_routing.data.apstra_datacenter_ct_routing_policy.vpn["Vendor_C"] will be read during apply
  # (config refers to values not yet known)
 <= data "apstra_datacenter_ct_routing_policy" "vpn" {
      + primitive         = (known after apply)
      + routing_policy_id = (known after apply)
    }

  # module.vpn_routing.apstra_datacenter_connectivity_template.vpn will be created
  + resource "apstra_datacenter_connectivity_template" "vpn" {
      + blueprint_id = (known after apply)
      + description  = "includes routing policies for [Vendor_A, Vendor_B, Vendor_C]"
      + id           = (known after apply)
      + name         = "IP+BGP handoff to VPN block"
      + primitives   = [
          + (known after apply),
        ]
      + tags         = [
          + "terraform",
          + "test",
        ]
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_A"] will be created
  + resource "apstra_datacenter_routing_policy" "vpn" {
      + blueprint_id        = (known after apply)
      + description         = "Vendor_A: Import count: 1 Export count: 2"
      + expect_default_ipv4 = true
      + expect_default_ipv6 = true
      + export_policy       = {
          + export_l2_edge_subnets        = false
          + export_l3_edge_server_links   = false
          + export_loopbacks              = false
          + export_spine_leaf_links       = false
          + export_spine_superspine_links = false
          + export_static_routes          = false
        }
      + extra_exports       = [
          + {
              + action = "permit"
              + prefix = "10.5.16.0/24"
            },
          + {
              + action = "permit"
              + prefix = "10.5.18.0/24"
            },
        ]
      + extra_imports       = [
          + {
              + action = "permit"
              + prefix = "172.16.0.0/24"
            },
        ]
      + id                  = (known after apply)
      + import_policy       = "extra_only"
      + name                = "Vendor_A"
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_B"] will be created
  + resource "apstra_datacenter_routing_policy" "vpn" {
      + blueprint_id        = (known after apply)
      + description         = "Vendor_B: Import count: 10 Export count: 1"
      + expect_default_ipv4 = true
      + expect_default_ipv6 = true
      + export_policy       = {
          + export_l2_edge_subnets        = false
          + export_l3_edge_server_links   = false
          + export_loopbacks              = false
          + export_spine_leaf_links       = false
          + export_spine_superspine_links = false
          + export_static_routes          = false
        }
      + extra_exports       = [
          + {
              + action = "permit"
              + prefix = "10.5.16.0/24"
            },
        ]
      + extra_imports       = [
          + {
              + action = "permit"
              + prefix = "172.17.0.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.2.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.4.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.6.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.8.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.10.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.12.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.14.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.17.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.17.18.0/24"
            },
        ]
      + id                  = (known after apply)
      + import_policy       = "extra_only"
      + name                = "Vendor_B"
    }

  # module.vpn_routing.apstra_datacenter_routing_policy.vpn["Vendor_C"] will be created
  + resource "apstra_datacenter_routing_policy" "vpn" {
      + blueprint_id        = (known after apply)
      + description         = "Vendor_C: Import count: 3 Export count: 2"
      + expect_default_ipv4 = true
      + expect_default_ipv6 = true
      + export_policy       = {
          + export_l2_edge_subnets        = false
          + export_l3_edge_server_links   = false
          + export_loopbacks              = false
          + export_spine_leaf_links       = false
          + export_spine_superspine_links = false
          + export_static_routes          = false
        }
      + extra_exports       = [
          + {
              + action = "permit"
              + prefix = "10.5.16.0/24"
            },
          + {
              + action = "permit"
              + prefix = "10.5.20.0/22"
            },
        ]
      + extra_imports       = [
          + {
              + action = "permit"
              + prefix = "172.18.0.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.18.3.0/24"
            },
          + {
              + action = "permit"
              + prefix = "172.18.5.0/24"
            },
        ]
      + id                  = (known after apply)
      + import_policy       = "extra_only"
      + name                = "Vendor_C"
    }

Plan: 23 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

   ```
   